import { Component } from '@angular/core';
import { Card } from '../../components/cards/cardTemplate/Card';
import { initFlowbite } from 'flowbite';
import { CarouselC } from '../../components/carousel-item/carouselTemplate/Carousel';

@Component({
  selector: 'app-home',
  templateUrl: './home.component.html',
  styleUrls: ['./home.component.css'],
})
export class HomeComponent {
  isHiddenCApplied = false;

  aiInfo: CarouselC[] = [
      {
        topic: 'ChatGPT',
        info: 'ChatGPT ორგანიზაცია OpenAI-ის პროექტია, რომელიც წარმოადგენს ერთგვარ მცდელობას, რომ ხელოვნურ ინტელექტთან საუბარი ბუნებრივი, უფრო ზუსტად კი — ადამიანური გახდეს. მომხმარებლებს შეუძლიათ, მყისიერი შეტყობინებების სახით, ბოტს სხვადასხვა კითხვა დაუსვან, ხოლო იგი სრული წინადადებებით უპასუხებს კითხვებს და ეცდება, საუბრის რიტმს მიბაძოს. თუმცა, არ გეგონოთ, რომ ChatGPT-ს ხასიათი ან რაიმე პიროვნული თვისებები აქვს; ის ადამიანებთან კომუნიკაციისთვის მრავალი წყაროდან შეგროვებულ ინფორმაციას იყენებს. შესაბამისად, თუკი ბოტს ჰკითხავთ, თავს როგორ გრძნობთ იგი გიპასუხებთ, რომ როგორც მანქანური სწავლების მოდელს, მას გრძნობები არ გააჩნია და შექმნილია მხოლოდ და მხოლოდ ტექსტის დამუშავებისა და გენერირებისთვის.',
        imageUrl: '../../../../assets/images/Chat-GPT.png',
        logoUrl: '../../../../assets/images/Chat-GPT-logo.png'
      },
      {
        topic: 'Midjourney',
        info: 'Midjourney AI-art არის ახალი ხელოვნური ინტელექტი, რომელიც დაგეხმარებათ, ფანტაზია რეალობად აქციოთ. ის ნახატებს ტექსტის საშუალებით ქმნის. თქვენ აძლევთ მას საკვანძო სიტყვებს, ის აგროვებს ინფორმაციას და ქმნის სურათს. ეს არის ახალი შესაძლებლობა ხელოვნების სამყაროსთვის.',
        imageUrl: '../../../../assets/images/midjourney.png', 
        logoUrl: '../../../../assets/images/midjourney-logo.png'
      },
      {
        topic: 'Google Translate',
        info: 'Google Translate — Google-ის ვებ-სერვისი, რომელიც განკუთვნილია ტექტის ნაწილის ან საიტის თარგმნისთვის სხვა ენაზე. სისტემას აქვს აგრეთვე ფუნქცია, რომელიც ახმოვანებს ტექსტს. Google Translate-ში მხარდაჭერილია 133 ენა, მათ შორისაა ქართული.',
        imageUrl: '../../../../assets/images/google-translate.png',
        logoUrl: '../../../../assets/images/google-translate-logo.png'
      }
  ];

  cards: Card[] = [
    {
      topic: 'ხელოვნური ინტელექტის შექმნა',
      info: 'მიუხედავად იმისა, რომ ხელოვნური ინტელექტის კონცეფციას უძველესი ფესვები აქვს მითოლოგიასა და ფოლკლორში, ხელოვნური ინტელექტის, როგორც კვლევის სფეროს ფორმალური წარმოშობა ხშირად ალან ტურინგის მუშაობას მიეკუთვნება. ტურინგმა, ბრიტანელმა მათემატიკოსმა და კომპიუტერულმა მეცნიერმა, 1936 წელს შემოგვთავაზა თეორიული გამოთვლითი მანქანის იდეა, რომელიც ახლა ცნობილია როგორც ტურინგის მანქანა, რომელმაც საფუძველი ჩაუყარა გამოთვლისა და ინტელექტის თეორიულ გაგებას.',
    },
    {
      topic: 'ხელოვნური ინტელექტის მიზანი',
      info: '1949 წლამდე კომპიუტერებს არ ჰქონდათ დაზვერვის ძირითადი წინაპირობა: მათ არ შეეძლოთ ბრძანებების შენახვა, მხოლოდ მათი შესრულება. სხვა სიტყვებით რომ ვთქვათ, კომპიუტერებს შეეძლოთ გაეკეთებინათ მაგრამ არ ახსოვდათ რა გააკეთეს. 1957 წლიდან 1974 წლამდე AI აყვავდა. კომპიუტერებს შეეძლოთ მეტი ინფორმაციის შენახვა და გახდა უფრო სწრაფი, იაფი და ხელმისაწვდომი. ასევე გაუმჯობესდა მანქანური სწავლის ალგორითმები და ადამიანებმა უკეთ გაიგეს, თუ რომელი ალგორითმი გამოიყენონ თავისი პრობლემისათვის. ამ წარმატებებმა, ისევე როგორც წამყვანი მკვლევარების ადვოკატირებამ დაარწმუნა სამთავრობო უწყებები, როგორიცაა თავდაცვის მოწინავე კვლევითი პროექტების სააგენტო, დაეფინანსებინათ AI კვლევები რამდენიმე ინსტიტუტში. მთავრობა განსაკუთრებით დაინტერესებული იყო აპარატით, რომელსაც შეეძლო სალაპარაკო ენის გადაწერა და თარგმნა, ისევე როგორც მონაცემთა მაღალი გამტარუნარიანობის დამუშავება. ოპტიმიზმი მაღალი იყო და მოლოდინი კიდევ უფრო მაღალი. ხელოვნური ინტელექტის საწყისი ნისლის გარღვევამ დაბრკოლებების მთა გამოავლინა. ყველაზე დიდი  დაბრკოლება იყო გამოთვლითი სიმძლავრის ნაკლებობა რაიმე მნიშვნელოვანის გასაკეთებლად: კომპიუტერებს უბრალოდ არ შეეძლოთ საკმარისი ინფორმაციის შენახვა ან საკმარისად სწრაფად დამუშავება. ჰანს მორავეკი, მაკკარტის დოქტორანტი იმ დროს, აცხადებდა, რომ „კომპიუტერები ჯერ კიდევ ძალიან   სუსტი იყო ინტელექტის გამოვლენისთვის“. მოთმინების კლებასთან ერთად დაფინანსებაც იკლო და კვლევა ათი წლის განმავლობაში ნელა მიმდინარეობდა. 1980-იან წლებში ხელოვნური ინტელექტი განახლდა ორი წყაროთ: ალგორითმული ინსტრუმენტების ნაკრების გაფართოება და სახსრების გაზრდა. ჯონ ჰოპფილდმა და დევიდ რუმელჰარტმა პოპულარიზაცია გაუკეთეს "ღრმა სწავლის" ტექნიკას, რომელიც საშუალებას აძლევდა კომპიუტერებს ესწავლათ გამოცდილების გამოყენებით. მეორე მხრივ, ედვარდ ფეიგენბაუმმა შემოიტანა საექსპერტო სისტემები, რომლებიც მიბაძავდნენ ადამიანის ექსპერტის გადაწყვეტილების მიღების პროცესს. საექსპერტო სისტემები ფართოდ გამოიყენებოდა ინდუსტრიებში. იაპონიის მთავრობამ დააფინანსა საექსპერტო სისტემები და სხვა ხელოვნური ინტელექტის მცდელობები, როგორც მათი მეხუთე თაობის კომპიუტერული პროექტის ნაწილი. ბედის ირონიით, სახელმწიფო დაფინანსებისა და საჯარო აჟიოტაჟის არარსებობის პირობებში, ხელოვნური ინტელექტი აყვავდა. 1990-იან და 2000-იან წლებში ხელოვნური ინტელექტის მრავალი მნიშვნელოვანი მიზანი მიღწეული იყო.' 
    },
  ];
  ngOnInit(): void {
    initFlowbite();
    };

  applyHClass() {
    this.isHiddenCApplied = !this.isHiddenCApplied;
  }
}