import { Component } from '@angular/core';
import { Card } from '../../components/cards/cardTemplate/Card';
import { initFlowbite } from 'flowbite';

@Component({
  selector: 'app-home',
  templateUrl: './home.component.html',
  styleUrls: ['./home.component.css'],
})
export class HomeComponent {

  cards: Card[] = [
    {
      topic: 'ხელოვნური ინტელექტის შექმნა',
      info: 'მიუხედავად იმისა, რომ ხელოვნური ინტელექტის კონცეფციას უძველესი ფესვები აქვს მითოლოგიასა და ფოლკლორში, ხელოვნური ინტელექტის, როგორც კვლევის სფეროს ფორმალური წარმოშობა ხშირად ალან ტურინგის მუშაობას მიეკუთვნება. ტურინგმა, ბრიტანელმა მათემატიკოსმა და კომპიუტერულმა მეცნიერმა, 1936 წელს შემოგვთავაზა თეორიული გამოთვლითი მანქანის იდეა, რომელიც ახლა ცნობილია როგორც ტურინგის მანქანა, რომელმაც საფუძველი ჩაუყარა გამოთვლისა და ინტელექტის თეორიულ გაგებას.',
    },
    {
      topic: 'ხელოვნური ინტელექტის მიზანი',
      info: '1949 წლამდე კომპიუტერებს არ ჰქონდათ დაზვერვის ძირითადი წინაპირობა: მათ არ შეეძლოთ ბრძანებების შენახვა, მხოლოდ მათი შესრულება. სხვა სიტყვებით რომ ვთქვათ, კომპიუტერებს შეეძლოთ გაეკეთებინათ მაგრამ არ ახსოვდათ რა გააკეთეს. 1957 წლიდან 1974 წლამდე AI აყვავდა. კომპიუტერებს შეეძლოთ მეტი ინფორმაციის შენახვა და გახდა უფრო სწრაფი, იაფი და ხელმისაწვდომი. ასევე გაუმჯობესდა მანქანური სწავლის ალგორითმები და ადამიანებმა უკეთ გაიგეს, თუ რომელი ალგორითმი გამოიყენონ თავისი პრობლემისათვის. ამ წარმატებებმა, ისევე როგორც წამყვანი მკვლევარების ადვოკატირებამ დაარწმუნა სამთავრობო უწყებები, როგორიცაა თავდაცვის მოწინავე კვლევითი პროექტების სააგენტო, დაეფინანსებინათ AI კვლევები რამდენიმე ინსტიტუტში. მთავრობა განსაკუთრებით დაინტერესებული იყო აპარატით, რომელსაც შეეძლო სალაპარაკო ენის გადაწერა და თარგმნა, ისევე როგორც მონაცემთა მაღალი გამტარუნარიანობის დამუშავება. ოპტიმიზმი მაღალი იყო და მოლოდინი კიდევ უფრო მაღალი. ხელოვნური ინტელექტის საწყისი ნისლის გარღვევამ დაბრკოლებების მთა გამოავლინა. ყველაზე დიდი  დაბრკოლება იყო გამოთვლითი სიმძლავრის ნაკლებობა რაიმე მნიშვნელოვანის გასაკეთებლად: კომპიუტერებს უბრალოდ არ შეეძლოთ საკმარისი ინფორმაციის შენახვა ან საკმარისად სწრაფად დამუშავება. ჰანს მორავეკი, მაკკარტის დოქტორანტი იმ დროს, აცხადებდა, რომ „კომპიუტერები ჯერ კიდევ ძალიან   სუსტი იყო ინტელექტის გამოვლენისთვის“. მოთმინების კლებასთან ერთად დაფინანსებაც იკლო და კვლევა ათი წლის განმავლობაში ნელა მიმდინარეობდა. 1980-იან წლებში ხელოვნური ინტელექტი განახლდა ორი წყაროთ: ალგორითმული ინსტრუმენტების ნაკრების გაფართოება და სახსრების გაზრდა. ჯონ ჰოპფილდმა და დევიდ რუმელჰარტმა პოპულარიზაცია გაუკეთეს "ღრმა სწავლის" ტექნიკას, რომელიც საშუალებას აძლევდა კომპიუტერებს ესწავლათ გამოცდილების გამოყენებით. მეორე მხრივ, ედვარდ ფეიგენბაუმმა შემოიტანა საექსპერტო სისტემები, რომლებიც მიბაძავდნენ ადამიანის ექსპერტის გადაწყვეტილების მიღების პროცესს. საექსპერტო სისტემები ფართოდ გამოიყენებოდა ინდუსტრიებში. იაპონიის მთავრობამ დააფინანსა საექსპერტო სისტემები და სხვა ხელოვნური ინტელექტის მცდელობები, როგორც მათი მეხუთე თაობის კომპიუტერული პროექტის ნაწილი. ბედის ირონიით, სახელმწიფო დაფინანსებისა და საჯარო აჟიოტაჟის არარსებობის პირობებში, ხელოვნური ინტელექტი აყვავდა. 1990-იან და 2000-იან წლებში ხელოვნური ინტელექტის მრავალი მნიშვნელოვანი მიზანი მიღწეული იყო.' 
    },
  ];
  ngOnInit(): void {
    initFlowbite();
    };
}